/*************************
输出一个菱形
*************************/
#include <stdio.h>
int main()
{
int n,i,j,k;
while(1)
{
	printf("/***************************/\n");
	printf("输出一个指定大小的菱形\n");
	printf("请输入菱形的边长n\n");
	scanf("%d",&n);

	//打印菱形的上半部分
	for(i=1;i<=n;i++)//输出的行数
	{
		//输出的空格数   第i行，有 n-i 个空格  随着行数的增加减少空格数字 ，直到i=n
	    for(j=1;j<=n-i;j++)
	    	printf(" ");
		 //输出 * ，第i行，有2*n-i个 * ,随着1 3 5 7 9 的数字增加到 i=n
		for(k=1;k<=2*i-1;k++)
	    	printf("$");
		printf("\n");
	}

	//打印菱形的下半部分

	for(i=1;i<=n-1;i++)  //打印n-1行
	{
		//打印空格，空格逐渐增加一个
		for(j=1;j<=i;j++)
			printf(" ");
		//打印 * ，每次打印2n-1个,逐渐减少
		for(k=1;k<=2*n-1-2*i;k++)
			printf("$");
	    printf("\n");
	}
	printf("/***************************/\n");
	/*
	n=3的时候：
	行数   * 的个数
	 1    3  = 2*3-1 - 2*1
	 2    1  = 2*3-1 - 2*2

	*/
}
return 0;
}
